In [1]:
import pandas as pd 
df=pd.read_csv(r"C:\Users\KARRI KUJITHA\OneDrive\Desktop\TEMP.csv")
df

       city  temp  humidity
0  kakinada  50.0       NaN
1  kakinada  45.0      46.0
2  kakinada  36.0      89.0
3       hyd   NaN      99.0
4       hyd  78.0      76.0
5       hyd  89.0       NaN
6  bengulur  78.0      86.0
7  bengulur   NaN      59.0
8  bengulur  90.0      52.0

In [2]:
df.isnull()

    city   temp  humidity
0  False  False      True
1  False  False     False
2  False  False     False
3  False   True     False
4  False  False     False
5  False  False      True
6  False  False     False
7  False   True     False
8  False  False     False

In [3]:
df.isnull().sum()

city        0
temp        2
humidity    2
dtype: int64

In [4]:
df_clean = df.dropna()
df_clean

       city  temp  humidity
1  kakinada  45.0      46.0
2  kakinada  36.0      89.0
4       hyd  78.0      76.0
6  bengulur  78.0      86.0
8  bengulur  90.0      52.0

In [5]:
df

       city  temp  humidity
0  kakinada  50.0       NaN
1  kakinada  45.0      46.0
2  kakinada  36.0      89.0
3       hyd   NaN      99.0
4       hyd  78.0      76.0
5       hyd  89.0       NaN
6  bengulur  78.0      86.0
7  bengulur   NaN      59.0
8  bengulur  90.0      52.0

In [7]:
df.temp=df.temp.fillna(10)
df

       city       temp  humidity
0  kakinada  50.000000       NaN
1  kakinada  45.000000      46.0
2  kakinada  36.000000      89.0
3       hyd  66.571429      99.0
4       hyd  78.000000      76.0
5       hyd  89.000000       NaN
6  bengulur  78.000000      86.0
7  bengulur  66.571429      59.0
8  bengulur  90.000000      52.0

In [8]:
df["temp"]=df["temp"].fillna(df.temp.mean())
df

       city       temp  humidity
0  kakinada  50.000000       NaN
1  kakinada  45.000000      46.0
2  kakinada  36.000000      89.0
3       hyd  66.571429      99.0
4       hyd  78.000000      76.0
5       hyd  89.000000       NaN
6  bengulur  78.000000      86.0
7  bengulur  66.571429      59.0
8  bengulur  90.000000      52.0

# reading files(CSV)

In [9]:
import pandas as pd
df =pd.read_csv(r"C:\Users\KARRI KUJITHA\OneDrive\Desktop\weather_data.csv")
df

         Date          City  Temperature_C  Humidity_% Condition
0  01-01-2025      Hyderbad             28          60     Sunny
1  02-01-2025    Vijayawada             29          62     Sunny
2  03-01-2025  Viskhapatnam             30          58    Cloudy
3  04-01-2025      Kakinada             31          55    Cloudy
4  05-01-2025      Banglore             32          57     Rainy
5  06-01-2025        Mumbai             33          59     Rainy
6  07-01-2025       Chennai             34          61     Sunny
7  08-01-2025    Rajamundry             32          63    Cloudy
8  09-01-2025         Eluru             31          64     Rainy
9  10-01-2025    Anakapalli             29          62     Sunny

In [10]:
df.head()

         Date          City  Temperature_C  Humidity_% Condition
0  01-01-2025      Hyderbad             28          60     Sunny
1  02-01-2025    Vijayawada             29          62     Sunny
2  03-01-2025  Viskhapatnam             30          58    Cloudy
3  04-01-2025      Kakinada             31          55    Cloudy
4  05-01-2025      Banglore             32          57     Rainy

In [11]:
df.tail()

         Date        City  Temperature_C  Humidity_% Condition
5  06-01-2025      Mumbai             33          59     Rainy
6  07-01-2025     Chennai             34          61     Sunny
7  08-01-2025  Rajamundry             32          63    Cloudy
8  09-01-2025       Eluru             31          64     Rainy
9  10-01-2025  Anakapalli             29          62     Sunny

In [12]:
df.Date

0    01-01-2025
1    02-01-2025
2    03-01-2025
3    04-01-2025
4    05-01-2025
5    06-01-2025
6    07-01-2025
7    08-01-2025
8    09-01-2025
9    10-01-2025
Name: Date, dtype: object

In [13]:
df[2:5]

         Date          City  Temperature_C  Humidity_% Condition
2  03-01-2025  Viskhapatnam             30          58    Cloudy
3  04-01-2025      Kakinada             31          55    Cloudy
4  05-01-2025      Banglore             32          57     Rainy

In [14]:
df[["Date","Temperature_C"]]

         Date  Temperature_C
0  01-01-2025             28
1  02-01-2025             29
2  03-01-2025             30
3  04-01-2025             31
4  05-01-2025             32
5  06-01-2025             33
6  07-01-2025             34
7  08-01-2025             32
8  09-01-2025             31
9  10-01-2025             29

In [15]:
import pandas as pd
df = pd.DataFrame({
    "name":["siri","kuji","josh","sri"],
    "humid":[20,25,19,22]
    })
df

   name  humid
0  siri     20
1  kuji     25
2  josh     19
3   sri     22